Revit 2027 API
IFCExportOptions.Assign Method
 Assigns the values of the IFCExportOptions to this options object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	IFCExportOptions sourceOptions
)
Public Sub Assign (
	sourceOptions As IFCExportOptions
)
public:
void Assign(
	IFCExportOptions^ sourceOptions
)
member Assign :
        sourceOptions : IFCExportOptions -> unit
Parameters
sourceOptions IFCExportOptions
 The source IFCExportOptions.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCExportOptions Class
Autodesk.Revit.DB Namespace